1)
Soit une zone de communication comprenant : 01 ZCOM.
05 ZCODE PIC X. 05 ZCDRET PIC 9.
88 ZCDRET-OK
88 ZCDRET-NON-TROUVE 05 ZNOM PIC X(10).
VALUE ZERO. VALUE 1.
EXO8 : SOUS-PROGRAMMES
Écrire un sous-programme EXOSP qui recherche dans un tableau de 5 postes le nom à partir d'un code renseigné par le programme appelant. Si le code est trouvé dans la table, le sous-programme retourne le code retour 0 ainsi que le nom sinon il retourne le code retour 1 au programme appelant. Tableau :
01 TAB.
05 PIC X(11) VALUE '1JEAN'.
05 PIC X(11) VALUE '2JEANNE'.
05 PIC X(11) VALUE '3NOEMIE'.
05 PIC X(11) VALUE '4CORNELIUS'. 05 PIC X(11) VALUE '5ALBERTINE'.
01 REDEFINES TAB.
05 POSTE OCCURS 5.
10 COD PIC X.
10 NOM PIC X(10).
Écrire le programme principal EXOPP qui appelle le sous-programme avec un code connu puis un code inconnu. Afficher le contenu de la zone de communication ZCOM après chaque appel.
