#***********************************************************************************************************************#
#  ÉNONCÉ : Mettre à jour le fichier KSDS API3.KSDS.ASSURES à partir du fichier séquentiel API0.MVT.ASSURES via un      #
#           accesseur multifonctions ACCESS3. Le fichier séquentiel contient toutes les informations des assurés à      #
#           mettre à jour das le fichier KSDS (création, modification ou suppression un ou plusieurs assurés).          #
#***********************************************************************************************************************#

Fichier KSDS : API3.KSDS.ASSURES
- Fichier d'enregistrements de longueur fixe de 80 caractères.
- Clé primaire = matricule de l'assuré
- Clé secondaire (via un index secondaire) = nom et prénom

Programme principal PROJ3 : Lecture du fichier séquentiel API0.MVT.ASSURES.
Chaque enregistrement représente un mouvement de mise à jour (création, modification ou suppression) dont les informations sont
à reporter dans le fichier KSDS API3.KSDS.ASSURES. Le programme n'accède pas au KSDS, il passe par l'accesseur dédié pour réaliser
l'action nécessaire. En fin de mise à jour, le programme affiche les informations de chaque assuré du KSDS (demande de lecture
séquentielle à l'accesseur).

Accesseur ACCESS3 : Il contient les ordres de lecture et de mise à jour d'un assuré dans le KSDS : lecture ; création ; modification ;
suppression ; ainsi que la lecture séquentielle du fichier.

Règles de contrôle et de mise à jour des informations : PROJ3 contrôle chaque variable du mouvement, en déduit l'action à réaliser,
effectue les contrôles sur ce mouvement en fonction de l'action et si le mouvement ne contient aucune erreur, appelle ACCESS3 pour
la mise à jour de l'assuré dans le KSDS.

Contrôles :
– Le matricule est obligatoire et doit être numérique sinon erreur 1
– le nom prénom est facultatif, sa présence ou absence détermine l'action à réaliser
– les autres zones sont facultatives, contrôler le format numérique pour les zones numériques

Déduction de l'action à effectuer :
– Créer l'assuré : Si le matricule, et nom/prénom sont renseignés et qu'il n'existe pas dans le KSDS
– Modifier l'assuré : i le matricule, et nom/prénom sont renseignés et qu'il existe dans le KSDS
NB : ne pas faire la mise à jour si pas de changement entre les zones du mouvement et celles de l'assuré dans le KSDS
– Supprimer l'assuré : Si le matricule est renseigné mais que le nom/prénom ne l'ai pas et qu'il existe dans le KSDS

PROGRAMME PRINCIPAL : PROJ3 - ACCESSEUR : ACCESS3

PROGRAMME PROJ3 :
   CBL DYNAM
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJ3.
      ******************************************************************
      * BUT : MISE A JOUR DU FIICHIER KSDS DES ASSURES                 *
      *       PAR APPEL D'UN ACCESSEUR                                 *
      ******************************************************************
       AUTHOR. GIUSEPPE.
       DATE-WRITTEN. 26/05/23.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
      * DECLARATION DU FICHIER MVT POUR MAJ KSDS ASSURES
       FILE-CONTROL.
           SELECT MVT ASSIGN TO MVT
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE  IS SEQUENTIAL
           FILE STATUS  IS FS-MVT.
       DATA DIVISION.
       FILE SECTION.
       FD  MVT
           RECORDING MODE IS F.
      * DECLARATION DU BUFFER DU FICHIER MVT
       01  B-ENR-MVT    PIC X(80).
       WORKING-STORAGE SECTION.
      * DESCRIPTION DE L'ENREGISTREMENT


      * DESCRIPTION DE L'ENREGISTREMENT
       01  WS-ENR-MVT.
           05 WS-MATRICULE        PIC 9(6).
           05 WS-NOM-PRENOM       PIC X(20).
           05 WS-RUE-ADRESSE      PIC X(18).
           05 WS-CODE-POSTAL      PIC 9(5).
           05 WS-VILLE            PIC X(12).
           05 WS-TYPE-VEHICULE    PIC X(1).
           05 WS-PRIME            PIC 9(4)V99.
           05 WS-BONUS-MALUS      PIC X(1).
           05 WS-TAUX             PIC 9(2).
           05                     PIC X(9).

      * FILE STATUS
       01  FS-MVT                 PIC 99   VALUE ZEROES.


      * ZONE DE COMMUNICATION AVEC ACCESSEUR
       01  ZASSURE.
           05 ZCODE-FONC          PIC X.
               88 OUVERTURE                VALUE 'O'.
               88 LECTURE                  VALUE 'L'.
               88 CREATION                 VALUE 'C'.
               88 MODIFICATION             VALUE 'M'.
               88 SUPPRESSION              VALUE 'S'.
               88 POSITIONNEMENT           VALUE 'T'.
               88 LECTURE-SEQ              VALUE 'Q'.
               88 FERMETURE                VALUE 'F'.
           05 ZMATRICULE          PIC 9(6).
           05 ZNOM-PRENOM         PIC X(20).
           05 ZRUE-ADRESSE        PIC X(18).
           05 ZCODE-POSTAL        PIC 9(5).
           05 ZVILLE              PIC X(12).
           05 ZTYPE-VEHICULE      PIC X(1).
           05 ZPRIME              PIC 9(4)V99.
           05 ZBONUS-MALUS        PIC X(1).
           05 ZTAUX               PIC 9(2).
           05 ZCODE-RET           PIC 9(2).
           05 ZLIBERR             PIC X(50).

       01 ACCESS3                 PIC X(8) VALUE 'ACCESS3'.

      * TABLE DES ERREURS
       01  TABERR.
           05                     PIC X(50) VALUE
           'MATRICULE INVALIDE'.
           05                     PIC X(50) VALUE
           'MATRICULE INEXISTANT'.
           05                     PIC X(50) VALUE
           'FIN DE LISTE'.
           05                     PIC X(50) VALUE
           'PROBLEME SUR FICHIER KSDS'.
       01  REDEFINES TABERR.
           05 POSTERR             PIC X(50) OCCURS 4.

      * INDICE DE BALAYAGE
       01  I                      PIC 99 VALUE ZEROES.

      * COMPTEURS
       01  CPT-LUS                PIC 99 VALUE ZEROES.
       01  CPT-CRE                PIC 99 VALUE ZEROES.
       01  CPT-MOD                PIC 99 VALUE ZEROES.
       01  CPT-SUP                PIC 99 VALUE ZEROES.

      * INDICATEUR DE FIN DE FICHIER MVT
       01                         PIC X  VALUE SPACES.
           88 FIN-MVT                    VALUE 'Y'.

      * INDICATEUR D'ERREUR
       01                         PIC X  VALUE SPACES.
           88 OK                         VALUE '0'.
           88 ERREUR                     VALUE 'Y'.

      * INDICATEUR DE PRESENCE DU NOM PRENOM
       01                         PIC X  VALUE SPACES.
           88 NOM-PRENOM-PRESENT         VALUE '0'.
           88 NOM-PRENOM-ABSENT          VALUE 'Y'.

      * INDICATEUR D'EXISTENCE DE L'ASSURE DANS LE KSDS
       01                         PIC X  VALUE SPACES.
           88 ASSURE-TROUVE              VALUE '0'.
           88 ASSURE-NON-TROUVE          VALUE 'N'.

       PROCEDURE DIVISION.
           PERFORM DEBUT
           PERFORM UNTIL FIN-MVT
              PERFORM TRT-MVT
              PERFORM READ-MVT
           END-PERFORM
           PERFORM FIN
           .


















